In [4]:
# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
import pandas as pd
data1 = [4,8,15,16,23,42]
df1 = pd.Series(data1)

In [5]:
df1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [6]:
# Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
# variable print it.
data2 = ["This", "is", "demo", "data", 5,6,7,8,9,10]
df2 = pd.Series(data2)

In [7]:
df2

0    This
1      is
2    demo
3    data
4       5
5       6
6       7
7       8
8       9
9      10
dtype: object

In [12]:
# Create a Pandas DataFrame that contains the following data:

# Then, print the DataFrame.
data3 = {
    'Name' : ["Alice", "Bob", "Claire"],
    'Age' : [25, 30, 27],
    'Gendeer': ["Female", "Male", "Female"]
}
df3 = pd.DataFrame(data3)
df3

     Name  Age Gendeer
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
-Dataframe is two dimensional here the data is stored in rows and columns just like spreadsheet
here df3 is a database
-Series is one dimensional it contains data of any one column
here df1 is a series

In [14]:
# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
# you give an example of when you might use one of these functions?
#selecting columns
df3["Age"]

0    25
1    30
2    27
Name: Age, dtype: int64

In [20]:
#filtering rows
df3["Age" ] > 25

0    False
1     True
2     True
Name: Age, dtype: bool

In [21]:
#get head values
df3.head(2)

    Name  Age Gendeer
0  Alice   25  Female
1    Bob   30    Male

In [22]:
#get tail values
df3.tail(2)

     Name  Age Gendeer
1     Bob   30    Male
2  Claire   27  Female

Which of the following is mutable in nature Series, DataFrame, Panel?
- DataFrame is Mutable

In [26]:
# Q7. Create a DataFrame using multiple Series. Explain with an example.
s1 = pd.Series([1,2,3])
s2 = pd.Series(["A","B","C"])
df4 = pd.DataFrame({
    "SID": s1,
    "Name": s2
})
df4

   SID Name
0    1    A
1    2    B
2    3    C